package com.dbs.omni.tw.util;

import java.util.ArrayList;
import java.util.HashMap;

/**
 * Created by sherman-thinkpower on 2017/6/19.
 */

public class AddressUtil {

    private String[] mAreasArray = new String[] {"1|台北市|100|中正區",
            "1|台北市|103|大同區",
            "1|台北市|104|中山區",
            "1|台北市|105|松山區",
            "1|台北市|106|大安區",
            "1|台北市|108|萬華區",
            "1|台北市|110|信義區",
            "1|台北市|111|士林區",
            "1|台北市|112|北投區",
            "1|台北市|114|內湖區",
            "1|台北市|115|南港區",
            "1|台北市|116|文山區",
            "2|基隆市|200|仁愛區",
            "2|基隆市|201|信義區",
            "2|基隆市|202|中正區",
            "2|基隆市|203|中山區",
            "2|基隆市|204|安樂區",
            "2|基隆市|205|暖暖區",
            "2|基隆市|206|七堵區",
            "3|新北市|207|萬里區",
            "3|新北市|208|金山區",
            "3|新北市|220|板橋區",
            "3|新北市|221|汐止區",
            "3|新北市|222|深坑區",
            "3|新北市|223|石碇區",
            "3|新北市|224|瑞芳區",
            "3|新北市|226|平溪區",
            "3|新北市|227|雙溪區",
            "3|新北市|228|貢寮區",
            "3|新北市|231|新店區",
            "3|新北市|232|坪林區",
            "3|新北市|233|烏來區",
            "3|新北市|234|永和區",
            "3|新北市|235|中和區",
            "3|新北市|236|土城區",
            "3|新北市|237|三峽區",
            "3|新北市|238|樹林區",
            "3|新北市|239|鶯歌區",
            "3|新北市|241|三重區",
            "3|新北市|242|新莊區",
            "3|新北市|243|泰山區",
            "3|新北市|244|林口區",
            "3|新北市|247|蘆洲市",
            "3|新北市|248|五股區",
            "3|新北市|249|八里鄉",
            "3|新北市|251|淡水區",
            "3|新北市|252|三芝區",
            "3|新北市|253|石門區",
            "4|宜蘭縣|260|宜蘭市",
            "4|宜蘭縣|261|頭城鎮",
            "4|宜蘭縣|262|礁溪鄉",
            "4|宜蘭縣|263|壯圍鄉",
            "4|宜蘭縣|264|員山鄉",
            "4|宜蘭縣|265|羅東鎮",
            "4|宜蘭縣|266|三星鄉",
            "4|宜蘭縣|267|大同鄉",
            "4|宜蘭縣|268|五結鄉",
            "4|宜蘭縣|269|冬山鄉",
            "4|宜蘭縣|270|蘇澳鎮",
            "4|宜蘭縣|272|南澳鄉",
            "5|新竹市|300|北區",
            "5|新竹市|300|東區",
            "5|新竹市|300|香山區",
            "6|新竹縣|302|竹北市",
            "6|新竹縣|303|湖口鄉",
            "6|新竹縣|304|新豐鄉",
            "6|新竹縣|305|新埔鎮",
            "6|新竹縣|306|關西鎮",
            "6|新竹縣|307|芎林鄉",
            "6|新竹縣|308|寶山鄉",
            "6|新竹縣|310|竹東鎮",
            "6|新竹縣|311|五峰鄉",
            "6|新竹縣|312|橫山鄉",
            "6|新竹縣|313|尖石鄉",
            "6|新竹縣|314|北埔鄉",
            "6|新竹縣|315|峨眉鄉",
            "7|桃園縣|320|中壢市",
            "7|桃園縣|324|平鎮市",
            "7|桃園縣|325|龍潭鄉",
            "7|桃園縣|326|楊梅鎮",
            "7|桃園縣|327|新屋鄉",
            "7|桃園縣|328|觀音鄉",
            "7|桃園縣|330|桃園市",
            "7|桃園縣|333|龜山鄉",
            "7|桃園縣|334|八德市",
            "7|桃園縣|335|大溪鎮",
            "7|桃園縣|336|復興鄉",
            "7|桃園縣|337|大園鄉",
            "7|桃園縣|338|蘆竹鄉",
            "8|苗栗縣|350|竹南鎮",
            "8|苗栗縣|351|頭份鎮",
            "8|苗栗縣|352|三灣鄉",
            "8|苗栗縣|353|南莊鄉",
            "8|苗栗縣|354|獅潭鄉",
            "8|苗栗縣|356|後龍鎮",
            "8|苗栗縣|357|通霄鎮",
            "8|苗栗縣|358|苑裡鎮",
            "8|苗栗縣|360|苗栗市",
            "8|苗栗縣|361|造橋鄉",
            "8|苗栗縣|362|頭屋鄉",
            "8|苗栗縣|363|公館鄉",
            "8|苗栗縣|364|大湖鄉",
            "8|苗栗縣|365|泰安鄉",
            "8|苗栗縣|366|銅鑼鄉",
            "8|苗栗縣|367|三義鄉",
            "8|苗栗縣|368|西湖鄉",
            "8|苗栗縣|369|卓蘭鎮",
            "9|台中市|400|中區",
            "9|台中市|401|東區",
            "9|台中市|402|南區",
            "9|台中市|403|西區",
            "9|台中市|404|北區",
            "9|台中市|406|北屯區",
            "9|台中市|407|西屯區",
            "9|台中市|408|南屯區",
            "9|台中市|411|太平區",
            "9|台中市|412|大里市",
            "9|台中市|413|霧峰區",
            "9|台中市|414|烏日區",
            "9|台中市|420|豐原區",
            "9|台中市|421|后里鄉",
            "9|台中市|422|石岡區",
            "9|台中市|423|東勢區",
            "9|台中市|424|和平區",
            "9|台中市|426|新社區",
            "9|台中市|427|潭子區",
            "9|台中市|428|大雅區",
            "9|台中市|429|神岡區",
            "9|台中市|432|大肚區",
            "9|台中市|433|沙鹿區",
            "9|台中市|434|龍井區",
            "9|台中市|435|梧棲區",
            "9|台中市|436|清水區",
            "9|台中市|437|大甲區",
            "9|台中市|438|外埔區",
            "9|台中市|439|大安區",
            "10|彰化縣|500|彰化市",
            "10|彰化縣|502|芬園鄉",
            "10|彰化縣|503|花壇鄉",
            "10|彰化縣|504|秀水鄉",
            "10|彰化縣|505|鹿港鎮",
            "10|彰化縣|506|福興鄉",
            "10|彰化縣|507|線西鄉",
            "10|彰化縣|508|和美鎮",
            "10|彰化縣|509|伸港鄉",
            "10|彰化縣|510|員林鎮",
            "10|彰化縣|511|社頭鄉",
            "10|彰化縣|512|永靖鄉",
            "10|彰化縣|513|埔心鄉",
            "10|彰化縣|514|溪湖鎮",
            "10|彰化縣|515|大村鄉",
            "10|彰化縣|516|埔鹽鄉",
            "10|彰化縣|520|田中鎮",
            "10|彰化縣|521|北斗鎮",
            "10|彰化縣|522|田尾鄉",
            "10|彰化縣|523|埤頭鄉",
            "10|彰化縣|524|溪州鄉",
            "10|彰化縣|525|竹塘鄉",
            "10|彰化縣|526|二林鎮",
            "10|彰化縣|527|大城鄉",
            "10|彰化縣|528|芳苑鄉",
            "10|彰化縣|530|二水鄉",
            "11|南投縣|540|南投市",
            "11|南投縣|541|中寮鄉",
            "11|南投縣|542|草屯鎮",
            "11|南投縣|544|國姓鄉",
            "11|南投縣|545|埔里鎮",
            "11|南投縣|546|仁愛鄉",
            "11|南投縣|551|名間鄉",
            "11|南投縣|552|集集鎮",
            "11|南投縣|553|水里鄉",
            "11|南投縣|555|魚池鄉",
            "11|南投縣|556|信義鄉",
            "11|南投縣|557|竹山鎮",
            "11|南投縣|558|鹿谷鄉",
            "12|嘉義市|600|東區",
            "12|嘉義市|600|西區",
            "13|嘉義縣|602|番路鄉",
            "13|嘉義縣|603|梅山鄉",
            "13|嘉義縣|604|竹崎鄉",
            "13|嘉義縣|605|阿里山鄉",
            "13|嘉義縣|606|中埔鄉",
            "13|嘉義縣|607|大埔鄉",
            "13|嘉義縣|608|水上鄉",
            "13|嘉義縣|611|鹿草鄉",
            "13|嘉義縣|612|太保市",
            "13|嘉義縣|613|樸子市",
            "13|嘉義縣|614|東石鄉",
            "13|嘉義縣|615|六腳鄉",
            "13|嘉義縣|616|新港鄉",
            "13|嘉義縣|621|民雄鄉",
            "13|嘉義縣|622|大林鎮",
            "13|嘉義縣|623|溪口鄉",
            "13|嘉義縣|624|義竹鄉",
            "13|嘉義縣|625|布袋鎮",
            "14|雲林縣|630|斗南鎮",
            "14|雲林縣|631|大埤鄉",
            "14|雲林縣|632|虎尾鎮",
            "14|雲林縣|633|土庫鎮",
            "14|雲林縣|634|褒忠鄉",
            "14|雲林縣|635|東勢鄉",
            "14|雲林縣|636|台西鄉",
            "14|雲林縣|637|崙背鄉",
            "14|雲林縣|638|麥寮鄉",
            "14|雲林縣|640|斗六市",
            "14|雲林縣|643|林內鄉",
            "14|雲林縣|646|古坑鄉",
            "14|雲林縣|647|莿桐鄉",
            "14|雲林縣|648|西螺鎮",
            "14|雲林縣|649|二崙鄉",
            "14|雲林縣|651|北港鎮",
            "14|雲林縣|652|水林鄉",
            "14|雲林縣|653|口湖鄉",
            "14|雲林縣|654|四湖鄉",
            "14|雲林縣|655|元長鄉",
            "15|台南市|700|中西區",
            "15|台南市|701|東區",
            "15|台南市|702|南區",
            "15|台南市|704|北區",
            "15|台南市|708|安平區",
            "15|台南市|709|安南區",
            "15|台南市|710|永康區",
            "15|台南市|711|歸仁區",
            "15|台南市|712|新化區",
            "15|台南市|713|左鎮區",
            "15|台南市|714|玉井區",
            "15|台南市|715|楠西區",
            "15|台南市|716|南化區",
            "15|台南市|717|仁德區",
            "15|台南市|718|關廟區",
            "15|台南市|719|龍崎區",
            "15|台南市|720|官田區",
            "15|台南市|721|麻豆區",
            "15|台南市|722|佳里鎮",
            "15|台南市|723|西港區",
            "15|台南市|724|七股區",
            "15|台南市|725|將軍區",
            "15|台南市|726|學甲區",
            "15|台南市|727|北門區",
            "15|台南市|730|新營區",
            "15|台南市|731|後壁區",
            "15|台南市|732|白河區",
            "15|台南市|733|東山區",
            "15|台南市|734|六甲區",
            "15|台南市|735|下營區",
            "15|台南市|736|柳營區",
            "15|台南市|737|鹽水區",
            "15|台南市|741|善化區",
            "15|台南市|742|大內區",
            "15|台南市|743|山上區",
            "15|台南市|744|新市區",
            "15|台南市|745|安定區",
            "16|高雄市|800|新興區",
            "16|高雄市|801|前金區",
            "16|高雄市|802|苓雅區",
            "16|高雄市|803|鹽埕區",
            "16|高雄市|804|鼓山區",
            "16|高雄市|805|旗津區",
            "16|高雄市|806|前鎮區",
            "16|高雄市|807|三民區",
            "16|高雄市|811|楠梓區",
            "16|高雄市|812|小港區",
            "16|高雄市|813|左營區",
            "16|高雄市|814|仁武區",
            "16|高雄市|815|大社區",
            "16|高雄市|820|岡山區",
            "16|高雄市|821|路竹區",
            "16|高雄市|822|阿蓮區",
            "16|高雄市|823|田寮區",
            "16|高雄市|824|燕巢區",
            "16|高雄市|825|橋頭區",
            "16|高雄市|826|梓官區",
            "16|高雄市|827|彌陀區",
            "16|高雄市|828|永安區",
            "16|高雄市|829|湖內區",
            "16|高雄市|830|鳳山區",
            "16|高雄市|831|大寮區",
            "16|高雄市|832|林園區",
            "16|高雄市|833|鳥松區",
            "16|高雄市|840|大樹區",
            "16|高雄市|842|旗山區",
            "16|高雄市|843|美濃區",
            "16|高雄市|844|六龜區",
            "16|高雄市|845|內門區",
            "16|高雄市|846|杉林區",
            "16|高雄市|847|甲仙區",
            "16|高雄市|848|桃源區",
            "16|高雄市|849|那瑪夏區",
            "16|高雄市|851|茂林區",
            "16|高雄市|852|茄萣區",
            "17|南海諸島|817|東沙",
            "17|南海諸島|819|南沙",
            "18|澎湖縣|880|馬公市",
            "18|澎湖縣|881|西嶼鄉",
            "18|澎湖縣|882|望安鄉",
            "18|澎湖縣|883|七美鄉",
            "18|澎湖縣|884|白沙鄉",
            "18|澎湖縣|885|湖西鄉",
            "19|金門縣|890|金沙鎮",
            "19|金門縣|891|金湖鎮",
            "19|金門縣|892|金寧鄉",
            "19|金門縣|893|金城鎮",
            "19|金門縣|894|烈嶼鄉",
            "19|金門縣|896|烏坵鄉",
            "20|連江縣|209|南竿鄉",
            "20|連江縣|210|北竿鄉",
            "20|連江縣|211|莒光鄉",
            "20|連江縣|212|東引鄉",
            "21|屏東縣|900|屏東市",
            "21|屏東縣|901|三地門鄉",
            "21|屏東縣|902|霧台鄉",
            "21|屏東縣|903|瑪家鄉",
            "21|屏東縣|904|九如鄉",
            "21|屏東縣|905|里港鄉",
            "21|屏東縣|906|高樹鄉",
            "21|屏東縣|907|鹽埔鄉",
            "21|屏東縣|908|長治鄉",
            "21|屏東縣|909|麟洛鄉",
            "21|屏東縣|911|竹田鄉",
            "21|屏東縣|912|內埔鄉",
            "21|屏東縣|913|萬丹鄉",
            "21|屏東縣|920|潮州鎮",
            "21|屏東縣|921|泰武鄉",
            "21|屏東縣|922|來義鄉",
            "21|屏東縣|923|萬巒鄉",
            "21|屏東縣|924|崁頂鄉",
            "21|屏東縣|925|新埤鄉",
            "21|屏東縣|926|南州鄉",
            "21|屏東縣|927|林邊鄉",
            "21|屏東縣|928|東港鎮",
            "21|屏東縣|929|琉球鄉",
            "21|屏東縣|931|佳冬鄉",
            "21|屏東縣|932|新園鄉",
            "21|屏東縣|940|枋寮鄉",
            "21|屏東縣|941|枋山鄉",
            "21|屏東縣|942|春日鄉",
            "21|屏東縣|943|獅子鄉",
            "21|屏東縣|944|車城鄉",
            "21|屏東縣|945|牡丹鄉",
            "21|屏東縣|946|恆春鎮",
            "21|屏東縣|947|滿洲鄉",
            "22|台東縣|950|台東市",
            "22|台東縣|951|綠島鄉",
            "22|台東縣|952|蘭嶼鄉",
            "22|台東縣|953|延平鄉",
            "22|台東縣|954|卑南鄉",
            "22|台東縣|955|鹿野鄉",
            "22|台東縣|956|關山鎮",
            "22|台東縣|957|海端鄉",
            "22|台東縣|958|池上鄉",
            "22|台東縣|959|東河鄉",
            "22|台東縣|961|成功鎮",
            "22|台東縣|962|長濱鄉",
            "22|台東縣|963|太麻里鄉",
            "22|台東縣|964|金峰鄉",
            "22|台東縣|965|大武鄉",
            "22|台東縣|966|達仁鄉",
            "23|花蓮縣|970|花蓮市",
            "23|花蓮縣|971|新城鄉",
            "23|花蓮縣|972|秀林鄉",
            "23|花蓮縣|973|吉安鄉",
            "23|花蓮縣|974|壽豐鄉",
            "23|花蓮縣|975|鳳林鎮",
            "23|花蓮縣|976|光復鄉",
            "23|花蓮縣|977|豐濱鄉",
            "23|花蓮縣|978|瑞穗鄉",
            "23|花蓮縣|979|萬榮鄉",
            "23|花蓮縣|981|玉里鎮",
            "23|花蓮縣|982|卓溪鄉" };

    private HashMap<String, HashMap<String, String>> cityMap;
    private HashMap<String, HashMap<String, ArrayList<String>>> postalMap;
    private ArrayList<String> cityArray;
    private ArrayList<String> postalArray;


    public AddressUtil() {
        getAreasMap();
    }


    private void getAreasMap() {
        cityMap = new HashMap<>();
        postalMap = new HashMap<>();
        cityArray = new ArrayList<>();
        postalArray = new ArrayList<>();

        for (String string : mAreasArray) {
            String[] area = string.split("\\|");

            HashMap<String, ArrayList<String>> postalValue = postalMap.get(area[2]);
            if(postalValue == null) {
                postalArray.add(area[2]);

                postalValue = new HashMap<>();
                ArrayList<String> regionArray = new ArrayList<>();
                regionArray.add(area[3]);
                postalValue.put(area[1], regionArray);
            } else {
                ArrayList regionArray = postalValue.get(area[1]);
                if(regionArray == null) {
                    regionArray = new ArrayList<>();
                }

                regionArray.add(area[3]);
                postalValue.put(area[1], regionArray);
            }

            postalMap.put(area[2], postalValue);


            HashMap<String,String> cityValue = cityMap.get(area[1]);
            if(cityValue == null) {
                cityValue = new HashMap<>();
                cityArray.add(area[1]);
            }
            cityValue.put(area[3], area[2]);
            cityMap.put(area[1], cityValue);

        }
    }

    public String getRegion(String postal) {
        HashMap<String, ArrayList<String>> postalValue = postalMap.get(postal);
        if(postalValue == null)
            return "";

        String[] citys =  postalValue.keySet().toArray(new String[postalValue.size()]);
        if(citys == null)
            return "";


        if(citys.length == 1){
            ArrayList<String> regions = postalValue.get(citys[0]);
            if(regions.size() == 1) {
                return regions.get(0);
            } else {
                return "";
            }
        } else {
            return "";
        }
    }

    public String getCity(String postal) {
        HashMap<String, ArrayList<String>> postalValue = postalMap.get(postal);
        if(postalValue == null)
            return "";

        String[] citys =  postalValue.keySet().toArray(new String[postalValue.size()]);
        if(citys == null)
            return "";

        if(citys.length == 1){
            return citys[0];
        } else {
            return "";
        }
    }

    public HashMap<String, HashMap<String, String>> getCityMap() {
        return cityMap;
    }

    public void setCityMap(HashMap<String, HashMap<String, String>> cityMap) {
        this.cityMap = cityMap;
    }

    public ArrayList<String> getCityArray() {
        return cityArray;
    }

}
